<<<<<<< HEAD
       identification division.
       program-id. Sample.

       environment division.
       configuration section.

       data division.
       working-storage section.
       01 WK-HOLD         PIC X.

       procedure division.
           Display "HELLO ALL".
           ACCEPT WK-HOLD.
           goback.
           
=======
       identification division.
       program-id. Sample.

       environment division.
       configuration section.

       data division.
       working-storage section.
       01 WK-HOLD         PIC X.

       procedure division.
           Display "HELLO ALL".
           ACCEPT WK-HOLD.
           goback.
           
>>>>>>> b6b6cfaf02e6a9020282ae5746b77892f5fa7f33
       end program Sample.